<a href="https://colab.research.google.com/github/dwds186/alphaco_test/blob/main/0927.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

파이썬에서 배우는 데이터 과학
- 빅데이터 분석기사 자격증 준비 (넘파이, 판다스, 사이킷런, 통계 모듈 등)
(단 1년에 2번만 시험 시행)
(올해는 이미 필기 접수 끝나서, 올해는 빅데이터 분석 준전문가 그게 유일)

#파이썬에서 배우는 데이터 과학


- NUMPY : 수치 연산 (행렬 연산)
--이공계 : 이공계에게 회사가 기대하는 것은 수리적인 능력, 즉 식을 세워서 연산할 수 있는 능력 : ex 피타고라스 정리 수식을 코드로 변환 가능한가?


- PANDAS : 엑셀 데이터 처리
-- 데이터 다루는 사람들은 기본적으로 이 라이브러리 활용함
-- 하나 유일한 단점 : 진짜 LITERALLY "BIG" 데이터를 다루는 툴로써는 부적합(속도가 느리기 때문 -> 데이터 50g 정도 되면 colab에서 못 돌림 로컬에서 처리해야 함)

- SCIPY & STATSMODELS & PINGOUIN : 통계 라이브러리
-- 단점 기존솔루션(SPSS, R) 결과값, 설명 등이 조금 불친절함

- MATPLOTLIB & SEABORN : 시각화 라이브러리 (정적인 이미지 static 이미지 형태로 출력해줌)

- PLOTLY: 인터액티브 시각화 (데이터 조회 기간을 선택하거나 특정 기준으로 데이터를 필터링하는 것을 인터액티브라고 함)


이제 시각화가 끝났으니...

- SCIKIT-LEARN : 머신러닝

강사님의 팁 : 만약 본인이 코드에 관심이 없다면 시각화는 버리는 것을 추천
특히 시각화를 예쁘게 하려면 이미지 하나 뽑는데 멧플롯이랑 씨본 이런것으로 코드 200줄 나옴

본인이 강점이 있는 라이브러리를 하나 깊게 파는 것을 추천

넘파이 판다스 등 여러 가지 배우는 것도 버거움

시각화 라이브러리만을 정말 깊이 있게 가르치는 전문 서적은 아직 출시 안 된 것으로 알고 있음 그리기 도구이기 때문에 정말 간단하게만 가르칠 수도 있고 진짜 깊이 있게 들어갈 수도 있음

#라이브러리 설치

In [ ]:
!pip install numpy

Requirement already satisfied: numpy in /usr/local/lib/python3.10/dist-packages (1.26.4)

pip install -r requirements.txt
이렇게 하면 됨
근데 그때 그때 필요한 라이브러리가 추가될 수 있어요

이럴 때에는
!pip install numpy
(구글 코랩, 주피터 모두 동일)
이런식으로 하면 됩니다.

In [ ]:
import numpy as np

print(np.__version__)
#help(np) #이거 누르면 엄청 자세하게 설명해줌

1.26.4

In [ ]:
num1 = [1,2,3]
num2=[4,5,6]
#우리의 기대는 [5,7,9]
#num1+num2 -> 이것은 그냥 2가지 서로 다른 리스트를 연결할 뿐...
#넘파이 사용하지 않고 하려면, 반복문으로 처리해야 함 chat gpt한테 물어봤더니 zip사용해서 반복으로 더했음 -> 비효율적이고 시간 오래 걸림

[1, 2, 3, 4, 5, 6]

In [ ]:
num1_arr=np.array(num1)
num2_arr=np.array(num2)
num1_arr+num2_arr

#이제부터 수치연산 할 때에는 넘파이를 사용한다고 생각하셈
# 왜 쓰는지 알겠지? 만약에 2차원 배열을 더할려면 넘파이 없이 반복문으로만 하려고 하면 정말 비효율적임

array([5, 7, 9])

https://numpy.org/doc/stable/reference/generated/numpy.ndarray.html

In [ ]:
print(type(num1_arr))
#<class 'numpy.ndarray'> 클래스에는 속성과 메서드가 있음

<class 'numpy.ndarray'>

In [ ]:
num1_arr.T

array([1, 2, 3])

In [ ]:
num1_arr.data

In [ ]:
num1_arr.dtype #dtype('int64')

dtype('int64')

In [ ]:
num1_arr.shape #there are 3 elements and 1 dimension

(3,)

In [ ]:
num1_arr.ndim #1차원이라는 뜻

1

In [ ]:
#공식 문서에 설명이 제대로 안 되어 있으면 chat gpt에게 물어보면 됨

In [ ]:
num1_arr.max()

3

dtype('int64')에 대한 간단한 이야기


우리 회사에서 주로 다루는 데이터는 0원 ~ 백만원 미만이다
0~1000000

내가 주로 쓰고자 하는 데이터의 단위가 크지 않다면 굳이 큰 메모리 쓸 필요가 없음

In [ ]:
num1_arr=np.array(num1,dtype='int8')

#배열 만드는 방법

#기본적으로 다른 데이터 자료형으로 넘파이 배열로 전환

In [ ]:
#배열 생성
print(np.ones(3))

[1. 1. 1.]

In [ ]:
print(np.zeros(3))

[0. 0. 0.]

In [ ]:
print(np.ndarray(shape=(2,2,2), dtype=float, order='F'))

[[[4.99879724e-310 0.00000000e+000]
  [0.00000000e+000 0.00000000e+000]]

 [[0.00000000e+000 0.00000000e+000]
  [0.00000000e+000 0.00000000e+000]]]

In [ ]:
arr = np.ndarray(shape=(2,2,2), dtype=float, order='F')
arr.shape

(2, 2, 2)

배열의 차원을 변경

In [ ]:
temp_arr=np.arange(16)
temp_arr
#이것은 1차원임 이제 얘를 2차원으로 만들고 싶은 거야...


#temp_arr.reshape(2,8)
temp_arr.reshape(4,4)
#arrange의 배수가 되도록 n*m으로 할 수 있음

temp_arr.reshape(2,2,4)
temp_arr.reshape(1,2,8)

#1차원 배열의 길이 개수가 전체 원소 개수임

array([[[ 0,  1,  2,  3,  4,  5,  6,  7],
        [ 8,  9, 10, 11, 12, 13, 14, 15]]])

In [ ]:
a16=np.array(1.333333, dtype=np.float16)
a32=np.array(1.333333, dtype=np.float32)

print(a16)
print(a32)

#이공계에서 함수 만들어서 수식 연산할 때 소수점 자리수 신경 써야 합니다
#print(a16) #1.333
#print(a32) #1.333333

print(a16/3)
print(a32/3)

1.333
1.333333
0.4443359375
0.44444433848063153

In [ ]:
arr=np.array([-1,2,-3])
arr
arr/0 #<ipython-input-39-ecedb38e334b>:3: RuntimeWarning: divide by zero encountered in divide arr/0
#array([-inf, -inf, -inf])

#메서드여러가지사용하보면의도하지않게0으로나눠지게될경우가생김

<ipython-input-42-95c886bf159d>:3: RuntimeWarning: divide by zero encountered in divide
  arr/0 #<ipython-input-39-ecedb38e334b>:3: RuntimeWarning: divide by zero encountered in divide arr/0

array([-inf,  inf, -inf])

결측치


-missing values : 잃어버린 값

-nan : not a number, ==> 아직 정의되지 않는 숫자를 의미

In [ ]:
print(np.nan, type(np.nan))

nan <class 'float'>

In [ ]:
print(np.inf, type(np.inf))

inf <class 'float'>

In [ ]:
print(-np.inf, type(-np.inf))

-inf <class 'float'>

왜 nan과 inf의 타입이 float인지는 궁금해하지 마세요
이건 그냥 약속!

In [ ]:
arr=np.array([-1,2,-3])
print(arr+np.nan)
print(arr+np.inf)

# 계산 중 nan이나 inf를 만나면 뭔가 결측치나 무한대가 있구나라고 생각하면 됩니다
# 이건 에러는 아닙니다...
# 주어진대로 연산했는데 그냥 중간에 행렬 값에 무언가 이상한게 (결측치든 무한대든) 들어갔다는 의미입니다...

[nan nan nan]
[inf inf inf]

#인덱싱 & 슬라이싱

In [ ]:
arr=np.arange(10)
arr[1:5]

array([1, 2, 3, 4])

In [ ]:
arr=np.arange(10).reshape(2,5)
arr # array([[0, 1, 2, 3, 4],[5, 6, 7, 8, 9]])
arr[0][4]

4

In [ ]:
arr=np.arange(10000).reshape(100,100)
#arr[0:4][0:1]
#3차원되면정말인간이이해하기엄청어려움

array([[ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15,
        16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31,
        32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47,
        48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63,
        64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79,
        80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95,
        96, 97, 98, 99]])

In [ ]:
arr=np.arange(4)
arr
arr[:2]

array([0, 1])

In [ ]:
arr = np.arange(20).reshape(4,5)
arr

#array([[ 0,  1,  2,  3,  4],
#       [ 5,  6,  7,  8,  9],
#       [10, 11, 12, 13, 14],
#       [15, 16, 17, 18, 19]])

# 789, 12 13 14 , 17 18 19 만 가져오고 싶음
arr[1][2:5]
arr[2][2:5]
arr[3][2:5]

array([36, 39, 42])

In [ ]:
arr = np.arange(20).reshape(4,5)
arr


# 789, 12 13 14 , 17 18 19 만 가져오고 싶음
arr[1][2:5]
arr[2][2:5]
arr[3][2:5]

#arr[행:열]
arr[1:4, 2:5]
arr[1: , 2:]

array([[ 7,  8,  9],
       [12, 13, 14],
       [17, 18, 19]])

![image.png]()

![image.png]()

https://numpy.org/doc/stable/user/basics.broadcasting.html

#브로드캐스팅 연산브로드캐스팅 연산

In [ ]:
a=np.array([1,2,3])
b=np.array([1,2,3])
a+b

array([2, 4, 6])

In [ ]:
a=np.array([1,2,3])
#3.0이라고 하는 값 자체는 한 번만 썼지만 a에 있는 3개에 모두 3.0이 각각 더해졌습니다
# 보이지 않는 3.0 3.0 3.0 이라는 1차원 배열이 만들어졌다고 생각할 수 있어요
# 배열이 달라도 자기들이 알아서 브로드캐스팅 규칙에 따라 만들게 됨
b=3.0
a+b

array([4., 5., 6.])

In [ ]:
#문제1
#모든 값이 0으로 2차원 배열 (5,5)만드세요

arr = np.array()

##조건 연산
-원하는 결과값 : true or false

In [7]:
import numpy as np
arr=np.array([10,20,30])
arr > 10 # array([False,  True,  True])
# 값이 10 초과인 것만 가지고 오고 싶어요!
# 이 컨셉을 감을 잘 잡아야 해요!

array([False,  True,  True])

In [8]:
arr = np.array([10,20,30])
cond = [False,  True,  True]

arr[cond] #array([20, 30])
# 인덱스 0번째는 false라서 빠지고 출력 되었음
# 이 컨셉을 감을 잘 잡아야 해요!

array([20, 30])

In [12]:
# 술집 운영 중이고 미성년자 출입 금지 하려고 함
arr = np.array([18,20,50,30,16])
cond = arr > 18

arr[cond]

array([20, 50, 30])

In [13]:
arr = np.array([18,20,50,30,16])
arr[arr>18]
#이렇게 간단하게도 사용 가능함

array([20, 50, 30])

In [21]:
arr = np.array([18,20,50,30,16,65,70])

con0 = arr>18
con1=arr<65

arr[con0&con1]

# array([20, 50, 30]) condition1과 condition2를 모두 만족하는 것만 가지고 옴

array([20, 50, 30])

In [26]:
arr[con0 | con1]
# array([20, 50, 30]) condition1과 condition2 중 하나 이상을  만족하는 것만 가지고 옴

#권장사항, 이유 : 판다스 다중조건문 필터링 할 때는 아래 방법으로만 가능
#()소괄호 해주세요
arr[(con0 | con1)]

array([18, 20, 50, 30, 16, 65, 70])

numpy 적용한 코드 -> pandas에서도 적용됩니다

왜냐하면
pandas는 based on NumPy

=> 라이브러리 설치할 때
numpy, pandas 보통 이렇게 2개 하게 되는데

사실은 pandas만 설치해도, 자동으로 넘파이가 설치됨

이것을 우리는 라이브러리 종속성이라고 부름

##np.where

In [27]:
import numpy as np

a=np.arange(10)
a

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [28]:
np.where(a<5,a,10*a)

array([ 0,  1,  2,  3,  4, 50, 60, 70, 80, 90])

이 코드는 NumPy 라이브러리를 사용하여 배열을 생성하고 조건에 따라 값을 변경하는 방법을 보여줍니다. 하나씩 살펴보겠습니다.

np.arange(10): 이 함수는 0부터 9까지의 정수로 구성된 1차원 배열을 생성합니다. 즉, a는 다음과 같은 배열이 됩니다:

python
코드 복사
a = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
np.where(a < 5, a, 10 * a): 이 함수는 세 개의 인자를 받습니다:

첫 번째 인자: 조건입니다. a < 5는 배열 a의 각 요소가 5보다 작은지를 검사합니다.
두 번째 인자: 조건이 True일 때 반환할 값입니다. 여기서는 a의 값입니다.
세 번째 인자: 조건이 False일 때 반환할 값입니다. 여기서는 10 * a 즉, a의 값을 10배한 값입니다.
이 조건을 적용하면:

a의 값이 5보다 작으면 해당 값을 유지하고,
5 이상이면 그 값을 10배로 변경합니다.
따라서 결과는 다음과 같습니다:

a < 5: [True, True, True, True, True, False, False, False, False, False]
조건이 True인 요소는 그대로 유지하고,
조건이 False인 요소는 10배가 됩니다.
최종 결과는 다음과 같은 배열이 됩니다:

python
코드 복사
[ 0,  1,  2,  3,  4, 50, 60, 70, 80, 90]
이 배열은 조건에 따라 원래의 값이나 10배의 값으로 변경된 것입니다.

# 함수와 메서드

In [34]:
# 함수와 메서드
arr=np.arange(8).reshape(4,2)
arr.sum()
arr

array([[0, 1],
       [2, 3],
       [4, 5],
       [6, 7]])

In [35]:
arr.sum()

28

In [38]:
arr.sum(axis=None)

28

In [33]:
arr.sum(axis=0)

#x축 방향으로 데이터의 합을 구하라, 행 단위

array([12, 16])

In [37]:
arr.sum(axis=1)
#y축 방향으로 데이터의 합을 구하라, 열 단위

array([ 1,  5,  9, 13])

In [60]:
#무작위 랜덤 함수 사용
np.random.seed(42) # -> 이것을 추가하면 np.random.randint(10)의 값이 고정됨 -> 나중에 머신러닝 할 때 이 코드를 자주 사용하게 됨
np.random.randint(10)

6

In [65]:
np.random.randint(46,size=6) # 로또 번호 # 46이 의미하는 것은 0에서 45번째 까지의 숫자 중 무작위로 가지고 오겠다는 의미임

array([11, 21, 43, 24, 26, 41])

In [66]:
np.random.randint(46,size=(3,4))
#사이즈의 값으로 튜플 형태를 줄 수 있음

array([[27, 15, 14, 43],
       [ 2, 36,  6, 20],
       [ 8, 38, 17,  3]])

In [70]:
x=np.linspace(0,100,11) #linear space
print(x)
#When you run this code, it will output an array with 11 evenly spaced values between 0 and 100

[  0.  10.  20.  30.  40.  50.  60.  70.  80.  90. 100.]

#pandas series

In [72]:
import pandas as pd

In [73]:
pd.__version__

'2.1.4'

In [74]:
data=[10,20,30]
s=pd.Series(data)
s

0    10
1    20
2    30
dtype: int64

In [75]:
print(type(s))

<class 'pandas.core.series.Series'>

https://pandas.pydata.org/

In [76]:


data=np.arange(5)
s=pd.Series(data)
s

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [78]:

data=np.arange(5)
s=pd.DataFrame(data)
s

   0
0  0
1  1
2  2
3  3
4  4

In [80]:
data=["시가","고가"]
s=pd.Series(data)
s

0    시가
1    고가
dtype: object

In [81]:
data=[80000,"90000"]
s=pd.Series(data)
s

0    80000
1    90000
dtype: object

## 시리즈 인덱스

In [90]:
data=[1000,2000,3000]
s=pd.Series(data)
s.index #RangeIndex(start=0, stop=3, step=1)
print(s.index, "\n\n" ,type(s.index)) # <class 'pandas.core.indexes.range.RangeIndex'>

RangeIndex(start=0, stop=3, step=1)

 <class 'pandas.core.indexes.range.RangeIndex'>

In [92]:
list(s.index) #형변환

[0, 1, 2]

In [94]:
s.index.to_list()
#help(s.index) #클래스에는 항상 속성과 메서드가 존재함

[0, 1, 2]

In [96]:
#시리즈 생성하면서 인덱스도 같이 생성
data=[1000,2000,3000]
index=['a','b','c']

s=pd.Series(data,index)
s

a    1000
b    2000
c    3000
dtype: int64

In [107]:
#시리즈 생성하면서 인덱스도 같이 생성
data=[1000,2000,3000]
index=['메로나','월드콘','와']

s=pd.Series(data=data,index=index)
s.index

Index(['메로나', '월드콘', '와'], dtype='object')

In [108]:
s.values, type(s.values)

(array([1000, 2000, 3000]), numpy.ndarray)

#시리즈 인덱싱

In [109]:
print(s.iloc[0])

1000

In [110]:
#print(s.loc[0]) #이렇게하면keyerror발생함
print(s.loc['메로나']) #약간python의딕셔너리와유사한느낌

1000

In [113]:
#시리즈 생성하면서 인덱스도 같이 생성
data=[1000,2000,3000]

#s2는 인덱스가 없음

s2=pd.Series(data=data)
print(s2.iloc[0])
#print(s2.loc['메로나']) #이것은error발생함 # s2는 만들 때 인덱스 없이 만들었기 때문

1000

iloc에서의 0은 위치0을의미하고,
loc에서의0은라벨0을의미함

##슬라이싱

In [114]:
s

메로나    1000
월드콘    2000
와      3000
dtype: int64

In [115]:
s2

0    1000
1    2000
2    3000
dtype: int64

In [119]:
s.loc["메로나":"와"] #직관적으로 알 수 있음

메로나    1000
월드콘    2000
와      3000
dtype: int64

In [120]:
s2.iloc[0:2]

0    1000
1    2000
dtype: int64

In [121]:
s2.loc[0:2] #s.loc["메로나":"와"] 와 다르니까, 일단 하나 정해서 그것에 익숙해지는게 중요 # 이거 헷갈림

0    1000
1    2000
2    3000
dtype: int64

loc가 차라리 직관적이고 더 편하고 더 자주 쓰이니까, loc로 기억하세요!

##시리즈 수정/추가/삭제

In [122]:
s

메로나    1000
월드콘    2000
와      3000
dtype: int64

In [123]:
s.loc['메로나']=500

In [124]:
s

메로나     500
월드콘    2000
와      3000
dtype: int64

In [128]:
data=[1000,2000,3000]
index=['메로나','월드콘','와']

s=pd.Series(data=data,index=index)

In [129]:
s

메로나    1000
월드콘    2000
와      3000
dtype: int64

In [130]:
s.iloc[0]=500
s

메로나     500
월드콘    2000
와      3000
dtype: int64

In [131]:
data=[1000,2000,3000]
index=['메로나','월드콘','와']

s=pd.Series(data=data,index=index)

In [132]:
s['메로나']=500 #파이썬 키 밸류 값으로 바꾸는 것 이게 제일 직관적이긴 함 loc, iloc쓰는 것보다는 그래서 키 밸류 느낌으로 변환하는거 추천
# 단 이제 chat gpt나 프로젝트 하다 보면 loc, iloc 쓰는 경우도 있을테니 보고 해석할 수 있어야 함
s

메로나     500
월드콘    2000
와      3000
dtype: int64

#시리즈 연산

In [133]:
import pandas as pd

evan = pd.Series([10,20,30], index=['NAVER', 'APPLE', '엔비디아'])
딸1 = pd.Series([10,30,20], index=['엔비디아', 'NAVER', 'APPLE'])

In [134]:
evan

NAVER    10
APPLE    20
엔비디아     30
dtype: int64

In [135]:
딸1

엔비디아     10
NAVER    30
APPLE    20
dtype: int64

In [136]:
#우리 가족이 보유하고 있는 주식의 숫자를 계산
evan + 딸1

#이게 제대로 계산이 된다는 것에 매우 신기해 해야 함!

APPLE    40
NAVER    40
엔비디아     40
dtype: int64

In [138]:


evan = pd.Series([10,20,30], index=['NAVER', 'APPLE', '테슬라'])
딸1 = pd.Series([10,30,20], index=['엔비디아', 'NAVER', 'APPLE'])

evan + 딸1
#엔비디아와 테슬라는 NaN로 나옴

APPLE    40.0
NAVER    40.0
엔비디아      NaN
테슬라       NaN
dtype: float64

In [148]:
date = ["6/1", "6/2", "6/3", "6/4", "6/5"]
high = pd.Series([42800, 42700, 42050, 42950, 43000], index=date)
low = pd.Series([42150, 42150, 41300, 42150, 42350] , index=date)

"""

diff = high - low
print(diff)
이런식으로 나오게 하고 싶음


메소드 없이 반복문으로만 하려면
idx_max=0
val_max=0
이런식으로 엄청 복잡하게 가야함...


diff.idxmax()
"""
print()

In [149]:

diff = high - low
print(diff)
print(diff.idxmax())
print(diff.idxmin())

6/1    650
6/2    550
6/3    750
6/4    800
6/5    650
dtype: int64
6/4
6/2

In [ ]:
date = ["6/1", "6/2", "6/3", "6/4", "6/5"]
high = pd.Series([42800, 42700, 42050, 42950, 43000], index=date)
low = pd.Series([42150, 42150, 41300, 42150, 42350] , index=date)

diff = high - low
print(diff)

diff.idxmax(), diff[diff.idxmax()]
diff.idxmin(), diff[diff.idxmin()]

https://pandas.pydata.org/docs/reference/api/pandas.Series.cumprod.html

In [150]:
date = ["6/1", "6/2", "6/3", "6/4", "6/5"]
high = pd.Series([42800, 42700, 42050, 42950, 43000], index=date) #매도
low = pd.Series([42150, 42150, 41300, 42150, 42350] , index=date) #매수

In [152]:
profit=high/low #단순 수익률 계산
profit

6/1    1.015421
6/2    1.013049
6/3    1.018160
6/4    1.018980
6/5    1.015348
dtype: float64

In [153]:
profit.cumprod()
#첫날은 누적한 것이 없어서 값이 같게 나오는데, 이 이후부터는 조금씩 다름

6/1    1.015421
6/2    1.028671
6/3    1.047351
6/4    1.067230
6/5    1.083610
dtype: float64

#시리즈와 Map

In [162]:
text='1,234'
result=int(text.replace(',',''))
type(result), result

(int, 1234)

In [163]:
s=pd.Series(['1,234', '5,678', '12,345'])
#int(s)# TypeError발생함  cannot convert the series to <class 'int'>

In [165]:

num_str = ['1,234', '5,678', '12,345']
results = []
for num in num_str:
    temp = int(num.replace(',',''))
    print(temp, type(temp))
    results.append(temp)
results


#이런식으로 하면 너무 복잡해... # 판다스에서는 생각보다 반복문을 사용할 일이 생기지 않는다는 것을 명심!

1234 <class 'int'>
5678 <class 'int'>
12345 <class 'int'>

[1234, 5678, 12345]

In [173]:
def rm_comma(x):
    return int(x.replace(',',''))

In [174]:
s=pd.Series(['1,234', '5,678', '12,345'])
result=s.map(rm_comma)
result

0     1234
1     5678
2    12345
dtype: int64

In [176]:
def remove_dollar_sign(x):
    return float(x.replace('$', '').replace(',', ''))
s = pd.Series(['$1,234.56', '$5,678.90', '$12,345.67'])
result = s.map(remove_dollar_sign)
result

0     1234.56
1     5678.90
2    12345.67
dtype: float64

##문제
- 기준점이 13 이상
+ 크다 혹은 작다라고 이야기 해주는 코드

힌트 : s.map(사용자정의함수)

In [177]:
s=pd.Series([5,10,15,20])
s

0     5
1    10
2    15
3    20
dtype: int64

In [185]:
def bigorsmall(x):
    if x > 13:
        return "bigger than 13"
    else:
        return "13 or smaller than 13"
s=pd.Series([5,10,15,20])
result = s.map(bigorsmall)
result

0    13 or smaller than 13
1    13 or smaller than 13
2           bigger than 13
3           bigger than 13
dtype: object

In [184]:
def is_greater_13(x):

    return_text = None
    if x >= 13:
        return "크다"
    else:
        return "작다"

s = pd.Series([10, 15, 7, 20, 13])
s.map(is_greater_13)

0    작다
1    크다
2    작다
3    크다
4    크다
dtype: object

##필터링

In [187]:
data = [42500, 42550, 41800, 42550, 42650]
index = ['2019-05-31', '2019-05-30', '2019-05-29', '2019-05-28', '2019-05-27']
s = pd.Series(data=data, index=index)
s

2019-05-31    42500
2019-05-30    42550
2019-05-29    41800
2019-05-28    42550
2019-05-27    42650
dtype: int64

In [188]:
cond=s>42000
print(cond)

2019-05-31     True
2019-05-30     True
2019-05-29    False
2019-05-28     True
2019-05-27     True
dtype: bool

In [189]:
s[cond]

2019-05-31    42500
2019-05-30    42550
2019-05-28    42550
2019-05-27    42650
dtype: int64

In [191]:
s[s>42000] # 이렇게 하면 엄청 간단하게 1줄로 처리 가능함

2019-05-31    42500
2019-05-30    42550
2019-05-28    42550
2019-05-27    42650
dtype: int64

In [196]:
close = [42500, 42550, 41800, 42550, 42650]
open = [42600, 42200, 41850, 42550, 42500]
index = ['2019-05-31', '2019-05-30', '2019-05-29', '2019-05-28', '2019-05-27']

open = pd.Series(data=open, index=index)
close = pd.Series(data=close, index=index)

시가 vs 종가
종가가 높은 것이 더 좋으니까
문제 : 종가가 시가보다 높은 날을 구하세요

In [197]:
close > open

2019-05-31    False
2019-05-30     True
2019-05-29    False
2019-05-28    False
2019-05-27     True
dtype: bool

In [198]:
close[close>open]

2019-05-30    42550
2019-05-27    42650
dtype: int64